package src.localization;

import java.util.ListResourceBundle;

public class GUILabels_mk extends ListResourceBundle {

    private static final Object[][] contents =
    {
            {"log_in", "Најава"},
            {"login", "Најави се"},
            {"password", "Лозинка"},
            {"sign_up", "Регистрирај се"},
            {"sign_in", "Имаш налог? Најави се"},
            {"auth", "Авторизација"},
            {"reg", "Регистрација"},
            {"become", "Немаш налог? Регистрирај се"},
            {"already", "Веќе постои"},
            {"invalid", "Невалиден внос"},
            {"add", "ДОДАДИ"},
            {"exit", "ИЗЛЕЗ"},
            {"clear", "ИСПРАЗНИ"},
            {"b_help", "ПОМОШ"},
            {"info", "ИНФО"},
            {"map", "МАПА"},
            {"count", "БРОЈ ПО ВИД"},
            {"script", "ИЗВРШИ СКРИПТА"},
            {"remove_type", "ИЗБРИШИ ПО ВИД"},
            {"remove_id", "ИЗБРИШИ ПО ИД"},
            {"upd", "АЖУРИРАЈ ПО ИД"},
            {"username", "КОРИСНИЧКО ИМЕ"},
            {"vehicle", "Возило"},
            {"name", "Наслов"},
            {"creator", "Креатор"},
            {"coords", "Координати"},
            {"creation_date", "Датум на креирање"},
            {"type", "Вид"},
            {"capacity", "Капацитет"},
            {"ep", "Моќност"},
            {"fc", "Трошок"},
            {"all", "СЕ"},
            {"script_help", """
                    add {елемент} : додади нов елемент на колекцијата
                    execute_script име_на_фајл : прочитај и изврши скрипта од специфицираниот фајл. Скриптата содржи команди во истата форма во која се внесуваат
                    clear : испразни колекцијата
                    update идентификатор : ажурирај ја вредноста на ставката на колекцијата чија идентификација е еднаква на специфицираната
                    remove_by_id идентификатор : отстрани ставка од колекцијата според нејзиниот идентификатор
                    remove_all_by_type вид : отстрани од колекцијата сите ставки чија вредност на полето вид е еквивалентна на специфицираната
                    """},
            {"help", """
                    add {елемент} : додади нов елемент на колекцијата
                    execute_script име_на_фајл : прочитај и изврши скрипта од специфицираниот фајл. Скриптата содржи команди во истата форма во која се внесуваат
                    clear : испразни колекцијата
                    update идентификатор : ажурирај ја вредноста на ставката на колекцијата чија идентификација е еднаква на специфицираната
                    remove_by_id идентификатор : отстрани ставка од колекцијата според нејзиниот идентификатор
                    count_greater_than_type вид : испечати го бројот на елементи чија вредност на полето вид е поголема од специфицираната
                    help : испечати помош за достапни команди
                    exit : заврши со програмата (без зачувување на фајл)
                    remove_all_by_type вид : отстрани од колекцијата сите ставки чија вредност на полето вид е еквивалентна на специфицираната
                    info : испечати информации за колекцијата (вид, датум на иницијализација, број на елементи итн.)
                    """},
            {"separator", ","},
            {"date_format", "dd.MM.yyyy HH:mm:ss Z"},
            {"col_type", "Тип на колекција"},
            {"init_date", "Датум на иницијализација"},
            {"amount", "Број на елементи"},
            {"delete_ps", "Можете да ги избришете само возилата на кои вие сте креатор"},
            {"doesnt_exist", "Не постои"},
            {"not_ur", "Не е ваше"},
            {"deleted", "Број на избришани возила"},
            {"count_res", "Бројот на возила од видот е поголем од специфицираниот"},
            {"table", "МАСА"}
    };

    public Object[][] getContents() {
        return contents;
    }

}
